# **Описание**: Создайте программу для сравнения двух температур и определения их соотношения.
# 
# **Входные данные**: Встроенные переменные в коде программы: первая температура 18 градусов, вторая температура 22 градуса
# 
# **Выходные данные**: 
# - Результат сравнения первой и второй температуры на равенство
# - Результат проверки, больше ли первая температура второй
# - Результат проверки, меньше ли первая температура второй 
# - Результат проверки, больше или равна ли первая температура второй
# - Результат проверки, меньше или равна ли первая температура второй
# - Результат проверки неравенства температур
# 
# **Ограничения**: Используйте только операторы сравнения и присваивания
# 
# **Примеры**:
# Входные данные: температура1 = 18, температура2 = 22
# Output:
# False
# False
# True
# False
# True
# True

# Встроенные данные
temp1 = 18
temp2 = 22

# Ваш код здесь
print(temp1 == temp2)
print(temp1 > temp2)
print(temp1 < temp2)
print(temp1 >= temp2)
print(temp1 <= temp2)
print(temp1 != temp2)
