# **Описание**: Создайте программу для форматирования приветственного сообщения с помощью f-строк.
# **Входные данные**: Переменные заданы в коде: имя пользователя и его возраст
# **Выходные данные**: Отформатированная строка с приветствием в формате "Привет, [имя]! Тебе [возраст] лет."
# **Ограничения**: Использовать только f-строки для форматирования
# **Примеры**:
# Входные данные: name = "Анна", age = 25
# Выходные данные: Привет, Анна! Тебе 25 лет.
# Входные данные: name = "Иван", age = 30
# Выходные данные: Привет, Иван! Тебе 30 лет.

# Заданные данные
name = "Анна"
age = 25

# Ваш код здесь

print(f"Привет, {name}! Тебе {age} лет.")