# **Описание**: Создайте программу для объединения нескольких строк в одно предложение с правильными пробелами между словами
# **Входные данные**: Три переменные заданы в коде: subject (подлежащее), verb (глагол) и object (дополнение)
# **Выходные данные**: Одна строка, представляющая полное предложение с точкой в конце
# **Ограничения**: Использовать только конкатенацию строк через оператор + для объединения слов
# **Примеры**:
# Входные данные: subject = "Кот", verb = "ловит", object = "мышь"
# Выходные данные: Кот ловит мышь.
# Входные данные: subject = "Студент", verb = "читает", object = "книгу"
# Выходные данные: Студент читает книгу.

subject = "Кот"
verb = "ловит"
object = "мышь"

# Ваш код здесь
print(subject + " " + verb + " " + object + ".")